app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "body", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?)  [["name", "fd"], ["body", "er"], ["created_at", 2016-11-19 10:36:31 UTC], ["updated_at", 2016-11-19 10:36:31 UTC], ["category_id", 1]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "name" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["name", "lm"], ["body", ",m"], ["updated_at", 2016-11-19 09:58:12 UTC], ["id", 1]]